package site.concertseat.global.util;

import java.util.Random;

public class NicknameUtils {
    static String[] prefix = {
            "빛나는", "귀여운", "열정적인", "전설의", "수줍은", "사랑스러운", "화려한", "상큼한", "포근한", "싱그러운",
            "반짝이는", "폭풍같은", "달콤한", "매혹적인", "따뜻한", "차가운", "엉뚱한", "유니크한", "심쿵한", "달달한",
            "짜릿한", "명랑한", "멋진", "도도한", "센치한", "낭만적인", "몽환적인", "존재감있는", "청순한", "엣지있는",
            "핫한", "힙한", "유쾌한", "반전있는", "찐한", "잊지못할", "전율하는", "물오른", "희귀한", "쏘스윗한",
            "영롱한", "비범한", "감성적인", "버터같은", "레전드급", "비주얼폭발", "시크한", "터지는", "아이돌스러운", "무대위의"
    };
    static String[] suffix = {
            "응원봉", "무대", "엔딩요정", "스포일러", "입덕요정", "최애", "덕후", "카메라", "리허설", "버블",
            "포카", "슬로건", "직캠", "백스테이지", "포토카드", "팬레터", "애교", "고막", "피지컬", "퇴근길",
            "움짤", "무물", "퀸카", "티켓팅", "사녹", "선공개", "리액션", "팬싸", "입덕부정기", "컨셉",
            "코디", "헤메코", "떼창", "라이브", "월드투어", "드림스테이지", "앙코르", "팬아트", "뮤비", "공카",
            "디스패치", "비하인드", "브이앱", "아미밤", "응원법", "스밍", "팬덤", "오프더레코드", "레전드짤", "덕밍아웃"
    };

    public static String createRandomNickname() {
        Random rand = new Random();

        return prefix[rand.nextInt(prefix.length)] + " " + suffix[rand.nextInt(suffix.length)];
    }
}
